{
  "author": {
    "address": "1915 2nd Ave, Apt 710, Seattle WA 98101",
    "email": "siddharthverma314@gmail.com",
    "name": "Siddharth Verma",
    "phone": "(510) 935-5734",
    "website": "siddharthverma314.github.io"
  },
  "education": [
    {
      "courses": [
        "Machine Learning",
        "Artificial Intelligence",
        "Probability and Random Processes",
        "Theoretical Statistics*",
        "Information Theory and Coding*",
        "Security",
        "Operating Systems",
        "Data Structures",
        "Computer Architecture",
        "Algorithms",
        "Real Analysis"
      ],
      "dateRange": "2017--2021",
      "degree": "BA Computer Science & Music",
      "gpa": "3.965/4.0",
      "school": "UC Berkeley"
    }
  ],
  "experience": [
    {
      "dateRange": "Sep 2022--Current",
      "description": [
        "Trained large language models to assist merchants compose messages to buyers. Reduced overall friction in buyer-seller communication, resulting in improved business outcomes.",
        "Researching applying instruction finetuning LLMs to incorporate all models into one large multi-task strategy aiming to make it easy to incorporate additional features while increasing overall performance."
      ],
      "location": "Boston MA",
      "organization": "Square",
      "title": "Senior Machine Learning Engineer"
    },
    {
      "dateRange": "Aug 2021--Sep 2022",
      "description": [
        "Conducted empirical research on the impact of masking rate and masking strategy on Vision-Language pretraining, evaluating the models on various downstream multimodal tasks including VQA and NLVR.",
        "Investigated the reasoning capabilities of large language models by creating and curating a dataset of reasoning skills, and benchmarking OPT models of different sizes on this dataset."
      ],
      "location": "Seattle WA",
      "organization": "Meta (Facebook)",
      "title": "AI Resident"
    },
    {
      "dateRange": "Jun 2021--Aug 2021",
      "description": [
        "Implemented Transformer architecture from Attention is All You Need customized for Apple Silicon hardware.",
        "Trained the model on English-German translation to replicate results from the paper",
        "Optimized network architecture to support on-device compute"
      ],
      "location": "Seattle WA",
      "organization": "Apple",
      "title": "Machine Learning Intern"
    },
    {
      "dateRange": "Jan 2019--May 2021",
      "description": [
        "Performed cutting-edge research in chatbots, robotics and self-driving cars",
        "Advised by Prof. Sergey Levine and Prof. Chelsea Finn",
        "Research Areas: Deep Reinforcement Learning, Multi-Agent RL, Offline RL"
      ],
      "location": "Berkeley CA",
      "organization": "Berkeley Artificial Intelligence Research Lab",
      "title": "Undergraduate Researcher at Robotic AI and Learning Lab"
    }
  ],
  "honors": [
    {
      "date": "2021",
      "description": "Graduated with High Distinction. Equivalent to magna cum laude.",
      "name": "High Distinction"
    },
    {
      "date": "2021",
      "description": "Honor society for top graduates in college of L&S.",
      "name": "Phi Beta Kappa"
    },
    {
      "date": "2020",
      "description": "Awarded to the top students in EECS/CS who perform research.",
      "name": "EECS Honors"
    },
    {
      "date": "2019",
      "description": "Computer Science Honor Society. Was on the board of directors.",
      "name": "Upsilon Pi Epsilon"
    },
    {
      "date": "2019",
      "description": "Awarded semesterly to the top 10% of undergraduates.",
      "name": "Dean's List"
    }
  ],
  "research": [
    {
      "authorStatus": "Cofirst Author",
      "date": "Nov 2020",
      "description": [
        "Designed an RL algorithm to learn skills without manual interventions to reset the environment",
        "Implemented a Python RL framework using Pytorch and open-sourced it on Github.",
        "Trained a four-legged robot to walk and subsequently solve a maze using learned skills"
      ],
      "status": "Accepted",
      "title": "Reset-free robotic skill learning via Adversarial RL",
      "venue": "NeurIPS 2020"
    },
    {
      "authorStatus": "First Author",
      "date": "Apr 2022",
      "description": [
        "Trained a model to negotiate a price for a product using data from Craigslist.",
        "Architected an algorithm to fuse Reinforcement Learning with Language Models.",
        "Implemented various Offline RL algorithms like CQL and EMaQ."
      ],
      "status": "Accepted",
      "title": "Reinforcement Learning based Chatbots using Large Language Models",
      "venue": "NAACL 2022"
    },
    {
      "authorStatus": "First Author",
      "date": "Dec 2022",
      "description": [
        "Conducted a large-scale experimental analysis of a 335M parameter Vision-Language model.",
        "Designed a scientific experiment to analyze the effects of masking strategies and masking percent on downstream performance",
        "Evaluated the model on multiple downstream tasks like VQA and NLVR and performed data analysis on the results.",
        "Published findings on arxiv in a short-form paper revealing that masking strategy is not important"
      ],
      "status": "Preprint",
      "title": "Empirical investigation of masking strategies and rates in Vision-Language Pretraining"
    },
    {
      "authorStatus": "Contributor",
      "date": "Current",
      "description": [
        "Curated dataset comprised of various reasoning tasks grouped by reasoning skills like Mathematical and Common Sense Reasoning.",
        "Architected a Makefile based data pipeline to streamline the downloading and preprocessing of data from multiple sources.",
        "Finetuned multiple sizes of OPT upto 13B parameters",
        "Analyzed reasoning performance with respect to model size and reasoning skill."
      ],
      "status": "In Progress",
      "title": "Investigating Reasoning Capabilities of Large Language Models",
      "venue": "ACL 2023"
    }
  ],
  "skills": {
    "areas": [
      "NLP",
      "Reinforcement Learning",
      "Multimodal Learning",
      "Machine Learning",
      "Deep Learning",
      "Neural Networks",
      "Statistics"
    ],
    "languages": [
      "Python",
      "Haskell",
      "Rust",
      "C",
      "Java",
      "Go",
      "PureScript",
      "RISC-V",
      "SQL"
    ],
    "technologies": [
      "PyTorch",
      "Tensorflow",
      "Docker",
      "NixOS",
      "Unix/Bash",
      "Git",
      "Google Cloud"
    ]
  }
}
